In [102]:
import pandas as pd

In [103]:
##데이터 불러오기

In [104]:
selloutData=pd.read_csv('./dataset/kopo_channel_seasonality_new.csv')

In [105]:
##데이터 프레임 타입 변환
selloutData["QTY"]=selloutData["QTY"].astype(float)
selloutData["REGIONID"]=selloutData["REGIONID"].astype(str)
selloutData["YEARWEEK"]=selloutData["YEARWEEK"].astype(str)
selloutData["PRODUCT"]=selloutData["PRODUCT"].astype(str)

In [106]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

In [122]:
##원하는 컬럼 조회
selloutData[["REGIONID","PRODUCT"]].head()

  REGIONID    PRODUCT
0      A60   PRODUCT4
1      A60  PRODUCT59
2      A60  PRODUCT34
3      A60  PRODUCT47
4      A60  PRODUCT56

In [111]:
import numpy as np

In [ ]:
##불량데이터 처리

In [112]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"]<0,0,selloutData["QTY"])

In [121]:
selloutData[selloutData.QTY<0].head()

     REGIONID    PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
65        A02  PRODUCT16   201403  -1.0      0.0  2014   03
338       A08  PRODUCT36   201402  -1.0      0.0  2014   02
1270      A14  PRODUCT36   201405  -1.0      0.0  2014   05
1616      A17  PRODUCT60   201402  -1.0      0.0  2014   02
2035      A39   PRODUCT7   201404 -12.0      0.0  2014   04

In [114]:
## YEAR, WEEK컬럼 생성 및 53주차제거
selloutData["YEAR"] = selloutData.YEARWEEK.str[0:4]

In [120]:
selloutData["WEEK"] = selloutData.YEARWEEK.str[4:]
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

In [116]:
selloutData["WEEK"]=selloutData["WEEK"].astype(int)

In [117]:
refinedSelloutData=selloutData[selloutData.WEEK<=52]

In [119]:
refinedSelloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR  WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014     2
1      A60  PRODUCT59   201402  22275.0  22275.0  2014     2
2      A60  PRODUCT34   201402   4463.0   4463.0  2014     2
3      A60  PRODUCT47   201402      0.0      0.0  2014     2
4      A60  PRODUCT56   201402     23.0     23.0  2014     2

In [123]:
refinedSelloutData["WEEK"].max()

52

In [132]:
groupKey=["REGIONID","PRODUCT"]

In [136]:
groupData=selloutData.groupby(groupKey).agg(['mean','std'])['QTY_NEW']
groupData=groupData.reset_index()
groupData.head()

  REGIONID    PRODUCT           mean            std
0      A00  PRODUCT34     132.445860     154.867743
1      A00  PRODUCT58     105.235669     273.435108
2      A00  PRODUCT59   36086.547771   15192.174914
3      A01   PRODUCT1    5716.726115    3704.948589
4      A01  PRODUCT12  197052.777070  198866.717131

In [150]:
sortKey=["REGIONID","PRODUCT","YEARWEEK"]

In [151]:
sortedData=selloutData.sort_values(sortKey,inplace= True)

In [159]:
groupKey1=["REGIONID","PRODUCT","YEAR"]

In [166]:
groupData1=selloutData.groupby(groupKey1).agg(['mean','std'])['QTY_NEW']
groupData1=groupData1.reset_index()
groupData1.columns=["REGIONID","PRODUCT","YEAR","QTY_MEAN","QTY_STD"]    
groupData1.head()

  REGIONID    PRODUCT  YEAR    QTY_MEAN     QTY_STD
0      A00  PRODUCT34  2014  275.961538  162.179634
1      A00  PRODUCT34  2015   85.698113   72.858024
2      A00  PRODUCT34  2016   36.576923   94.897539
3      A00  PRODUCT58  2014    2.673077    3.889257
4      A00  PRODUCT58  2015    7.547170   14.909427

In [ ]:
# 데이터 조인
## pd.merge(selectExample, regionMasterData,\
## left_on="REGIONID", right_on = "REGIONID")\
## [["REGIONID","REGIONNAME","PRODUCT","YEARWEEK","QTY"]]
## mergeResult.head()

In [178]:
mergedData=pd.merge(selloutData,groupData1,left_on=["REGIONID","PRODUCT","YEAR"],right_on=["REGIONID","PRODUCT","YEAR"],how="left")\
[["REGIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN","QTY_STD"]]
mergedData.head()

  REGIONID    PRODUCT YEARWEEK  YEAR WEEK  QTY_NEW    QTY_MEAN     QTY_STD
0      A00  PRODUCT34   201401  2014   01    661.0  275.961538  162.179634
1      A00  PRODUCT34   201402  2014   02    679.0  275.961538  162.179634
2      A00  PRODUCT34   201403  2014   03    578.0  275.961538  162.179634
3      A00  PRODUCT34   201404  2014   04    532.0  275.961538  162.179634
4      A00  PRODUCT34   201405  2014   05    516.0  275.961538  162.179634

In [126]:
import pandas as pd
kopocustomerData=pd.read_csv('./dataset/kopo_customerdata.csv')
kopocustomerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [127]:
kopocustomerData[["CUSTOMERCODE","STATENAME","GENDER","TOTAL_AMOUNT"]].head()

   CUSTOMERCODE STATENAME  GENDER  TOTAL_AMOUNT
0       1503989    State2    Male         30300
1       1190338    State2    Male         46500
2       1424715    State2  Female         22700
3       2483305    State2    Male         31400
4       1178802    State2    Male         44900

In [23]:
##인덱스 알아보기
kopocustomerData.columns.get_loc("GENDER")

3

In [30]:
kopocustomerDatacolumns = kopocustomerData.columns

In [36]:
csCodeColNo = kopocustomerDatacolumns.get_loc("CUSTOMERCODE")
gdColNo = kopocustomerDatacolumns.get_loc("GENDER")

In [39]:
kopocustomerData.iloc[0:6,[csCodeColNo,gdColNo]]

   CUSTOMERCODE  GENDER
0       1503989    Male
1       1190338    Male
2       1424715  Female
3       2483305    Male
4       1178802    Male
5        859044    Male

In [28]:
dfc1=kopocustomerData.iloc[0:6,[0,3]]
dfc1

   CUSTOMERCODE  GENDER
0       1503989    Male
1       1190338    Male
2       1424715  Female
3       2483305    Male
4       1178802    Male
5        859044    Male